[{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Yoonji Han", "title": "Netflix removed an Indian film after religious viewers criticized meat-eating characters", "description": "A right-wing Hindu group filed a complaint accusing the film of \"intentionally\" hurting \"Hindu sentiments.\"", "url": "https://www.businessinsider.com/netflix-pulls-indian-film-annapoorani-after-facing-religious-backlash-2024-1", "urlToImage": "https://i.insider.com/65a5765b6979d737182350b0?width=1200&format=jpeg", "publishedAt": "2024-01-15T18:58:48Z", "content": "Netflix took down the Indian film 'Annapoorani: the Goddess of Food' after backlash from a Hindu nationalist group.Zee Studios\r\n<ul><li>Netflix took down an Indian film after receiving backlash from … [+3424 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Yasmeen Serhan", "title": "India Is Unveiling Its Controversial Temple of Ram. Here’s What to Know", "description": "The Ram Mandir, a Hindu temple, will be consecrated on January 22. Indian Prime Minister Narendra Modi will play a key role in the ceremony.", "url": "https://time.com/6564070/india-modi-temple-ram/", "urlToImage": "https://api.time.com/wp-content/uploads/2024/01/GettyImages-1933528813.jpg?quality=85", "publishedAt": "2024-01-18T15:47:26Z", "content": "A decades-long flashpoint in Indias sectarian politics is poised to reach a climax next week. The Ram Mandir, a Hindu temple, will be consecrated Jan 22. on a contested holy site once home to a mosqu… [+7394 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "With controversial temple launch, Modi to start 2024 India re-election bid", "description": "For Modi’s BJP, the Ram Mandir, built on the ruins of the demolished Babri Masjid, represents a promise fulfilled.", "url": "https://www.aljazeera.com/features/2024/1/16/with-controversial-temple-launch-modi-to-start-2024-india-re-election-bid", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/01/AP23363318181608-1705383493.jpg?resize=1920%2C1440", "publishedAt": "2024-01-16T06:33:59Z", "content": "Ayodhya, India For hundreds of years, a journey to Ayodhya for many Hindu pilgrims meant a walk down narrow lanes to the Hanuman Garhi Mandir, a temple honouring Hanuman, the monkey god. Now a wide s… [+6291 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Insiyah Vahanvaty", "title": "For the Indian Muslim, Ayodhya is everywhere", "description": "Indian secularism is buried under a mountain of saffron politics, as the Ram Temple in Ayodhya is celebrated.", "url": "https://www.aljazeera.com/opinions/2024/1/21/for-the-indian-muslim-ayodhya-is-everywhere", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/01/2024-01-21T072009Z_1300747487_RC24M5AG9278_RTRMADP_3_INDIA-RELIGION-TEMPLE-AYODHYA-1705840143.jpg?resize=1920%2C1440", "publishedAt": "2024-01-21T12:30:49Z", "content": "Flipping through the radio channels on my drive to a meeting, I notice four out of the nine pre-sets blare triumphant tunes celebrating the upcoming inauguration of the Ram Temple in Ayodhya. As I tu… [+4689 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat emerged as a brand under Modi: Vice President", "description": "The Vice President’s speech also found a mention of Lord Ram ahead of the grand consecration ceremony of Ram Mandir in Ayodhya on Monday.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-emerged-as-a-brand-under-modi-vice-president-9118294/", "urlToImage": "https://images.indianexpress.com/2024/01/VP.jpg", "publishedAt": "2024-01-20T00:24:57Z", "content": "Gujarat has emerged as a brand under the visionary leadership of Prime Minister Narendra Modi, Vice President Jagdeep Dhankhar said on Friday.In his address to students during the 72nd convocation of… [+1966 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Atri Mitra", "title": "Calcutta High Court rejects BJP’s plea to defer Mamata Banerjee’s January 22 Sampriti Rally", "description": "Rally has got nothing to do with Ram Mandir inauguration, says TMC spokesperson Kunal Ghosh.", "url": "https://indianexpress.com/article/cities/kolkata/calcutta-hc-bjp-plea-mamata-banerjee-sampriti-rally-9115551/", "urlToImage": "https://images.indianexpress.com/2024/01/bharatjodo-45.jpg", "publishedAt": "2024-01-18T10:14:43Z", "content": "The Calcutta High Court Thursday rejected BJP leader Suvendu Adhikaris plea seeking deferment of Mamata Banerjees Sampriti Rally (Harmony Rally) on January 22. The bench of Chief Justice T S Sivagnan… [+1656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hindu Jagran Manch hits out at Mamata for holding all-faith rally on Jan 22: ‘It’s anti-Hindu’", "description": "“Why Mamata Banerjee needs to hold a so-called all-faith rally on January 22, when it is a big day for the Hindus? It is nothing but appeasement politics,\" said HJM office-bearer Sanjay Shastri.", "url": "https://indianexpress.com/article/cities/kolkata/hindu-jagran-manch-hits-out-at-mamata-for-holding-all-faith-rally-on-jan-22-its-anti-hindu-9118301/", "urlToImage": "https://images.indianexpress.com/2024/01/VHP_5c2a85.jpg", "publishedAt": "2024-01-20T01:17:46Z", "content": "A day after the Calcutta High Court allowed the TMC to hold an all-faith harmony rally in Kolkata to coincide with the Ayodhya Ram Temple inauguration on January 22, a Hindu outfit, Hindu Jagran Manc… [+1415 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Ayodhya Ram Mandir Inauguration Live Updates: With one day to go for consecration, eyes of the Ram Lalla idol to be opened today", "description": "Ram Mandir Ayodhya Inauguration Live Updates: The major part of the rituals or Adhivas”  are expected to conclude on Sunday, a day preceding the Pran Pratishtha ceremony at the Ram Temple.", "url": "https://indianexpress.com/article/india/ayodhya-ram-mandir-inauguration-live-updates-pm-modi-9119978/", "urlToImage": "https://images.indianexpress.com/2024/01/cover_d08a82.jpg", "publishedAt": "2024-01-21T05:56:29Z", "content": "IT IS almost noon and the winter fog has just begun to lift. From a distance, one can spot an array of saffron flags featuring Lord Ram fluttering at the shop of Joginder Singh. Located in Meerut on … [+1592 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat CM flags off flag poles to be sent to Ayodhya temple", "description": "Prior to the flag off, he also performed the ceremonial worship of the nagaru (temple drum) crafted by the All India Dabgar Samaj at Dariyapur.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-cm-flags-off-flag-poles-to-be-sent-to-ayodhya-temple-9096885/", "urlToImage": "https://images.indianexpress.com/2024/01/gujarat-flag-pole.jpg", "publishedAt": "2024-01-05T15:31:34Z", "content": "Gujarat Chief Minister Bhupendra Patel Friday flagged off a 44-foot-long brass flag pole and other smaller six flag poles in Ahmedabad for the ‘pran pratistha’ of the Ram Mandir that is set to take p… [+833 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ram Mandir consecration: Ranbir Kapoor dresses up in dhoti as he leaves for Ayodhya with Alia Bhatt, Mukesh Ambani’s home Antilia lights up with ‘Jai Shri Ram’", "description": "Ram Mandir consecration: Ranbir Kapoor and Alia Bhatt were dressed traditionally as they left for Ayodhya. Ambani home Antilia was decorated ahead of Pran Pratishtha ceremony.", "url": "https://indianexpress.com/article/entertainment/bollywood/ram-mandir-consecration-ranbir-kapoor-leaves-for-ayodhya-with-alia-bhatt-mukesh-ambanis-antilia-jai-shri-ram-9121109/", "urlToImage": "https://images.indianexpress.com/2024/01/MixCollage-22-Jan-2024-08-44-AM-3781.jpg", "publishedAt": "2024-01-22T03:40:47Z", "content": "Actor couple Ranbir Kapoor and Alia Bhatt, along with filmmaker Rohit Shetty on Monday left for Ayodhya to attend the Ram Mandir Pran Pratishtha ceremony later in the day. Ranbir Kapoor, who is set t… [+1967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Fake Ram Mandir pran pratishtha invites target religious zeal on WhatsApp", "description": "Received an invite for a VIP pass for the Ram Mandir Pran Pratishtha ceremony on WhatsApp? It might be a scam.", "url": "https://indianexpress.com/article/technology/techook/fake-ram-mandir-pran-pratishtha-invites-target-religious-zeal-on-whatsapp-9108877/", "urlToImage": "https://images.indianexpress.com/2024/01/ram-mandir-ayodhya-3.jpg", "publishedAt": "2024-01-14T09:57:34Z", "content": "As the preparations for the pran pratishtha (establishment of the image in its vital breath or bringing life to the temple) are in full swing, scammers are misusing this opportunity and are exploitin… [+1576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Narayani Paswan", "title": "Ram temple and the new Independence day – freedom from colonial mindset for Bharat", "description": "Consecration ceremony of Ram temple in Ayodhya can be seen as an affirmation of our faith and belief systems", "url": "https://indianexpress.com/article/opinion/columns/ram-temple-and-the-new-independence-day-freedom-from-colonial-mindset-for-bharat-9114387/", "urlToImage": "https://images.indianexpress.com/2024/01/ram-temple-5.jpg", "publishedAt": "2024-01-18T01:37:37Z", "content": "With the adhivas of the shyam rang Ramlalla idol carved in Krishna Shila stone, in the sanctum sanctorum of Ram Janmabhoomi temple at Ayodhya, a struggle that has gone on for decades will culminate i… [+5147 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "It’s all Shri Ram for Ludhiana hosiery", "description": "Only a few shops had started making pullovers of with Ram temple logos stitched on in December and others joined too soon after with such designs on shawls, stoles and caps.", "url": "https://indianexpress.com/article/cities/chandigarh/shri-ram-ludhiana-hosiery-9116508/", "urlToImage": "https://images.indianexpress.com/2024/01/WhatsApp-Image-2024-01-19-at-10.36.31-AM.jpeg", "publishedAt": "2024-01-19T04:50:55Z", "content": "With pictures of Ram Temple in Ayodhya and slogans of ‘Jai Shri Ram’ on pullovers, shawls and caps, Ludhiana hosiery hub has joined the mandir inauguration frenzy with merchandise named ‘Ayodhya Shri… [+3655 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ajay Jadhav", "title": "As Pune BJP goes all out to mark Ram Mandir event, Congress’s Kasba MLA Dhangekar too organises outreach programmes", "description": "Kasba Peth legislator Ravindra Dhangekar, who won the BJP bastion last year, held felicitation programmes and a lamp distribution event in the city ahead of the Ram Mandir ceremony in Ayodhya.", "url": "https://indianexpress.com/article/cities/pune/pune-bjp-ram-mandir-event-congresss-mla-dhangekar-outreach-programmes-9116933/", "urlToImage": "https://images.indianexpress.com/2024/01/ram-mandir-ayodhya-inauguration-1.jpg", "publishedAt": "2024-01-19T08:03:03Z", "content": "With local BJP leaders in Pune going all out to reach voters through programmes to mark the inauguration of the Ram Mandir, the Congresss Kasba Peth MLA Ravindra Dhangekar, who started his political … [+2412 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Rajinikanth, Dhanush, Anupam Kher, Shefali Shah leave for Ayodhya ahead of Ram Mandir Pran Pratishtha ceremony", "description": "Rajinikanth, Pawan Kalyan, Dhanush and Anupam Kher have been invited to attend the Ram Temple consecration ceremony, which is to be held on January 22.", "url": "https://indianexpress.com/article/entertainment/bollywood/rajinikanth-dhanush-anupam-kher-shefali-shah-leave-for-ayodhya-ahead-of-ram-mandir-pran-pratishtha-ceremonyrajinikanth-dhanush-anupam-kher-shefali-shah-leave-for-ayodhya-to-be-part-of-pran-pratisht-91/", "urlToImage": "https://images.indianexpress.com/2024/01/MixCollage-21-Jan-2024-05-21-PM-1932.jpg", "publishedAt": "2024-01-21T12:35:13Z", "content": "Several actors from the Indian film industry, including Rajinikanth, Dhanush, Anupam Kher and Vivek Oberoi among others, on Sunday left for Ayodhya to attend the Ram Mandir Pran Pratishtha ceremony.P… [+2732 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Will visit Ayodhya Ram Mandir after January 22’: Karnataka CM Siddaramaiah", "description": "Siddaramaiah said the Congress does not support the BJP and the RSS’s attempts to politicise the consecration of the temple.", "url": "https://indianexpress.com/article/cities/bangalore/ayodhya-ram-mandir-visit-karnataka-cm-siddaramaiah-9107210/", "urlToImage": "https://images.indianexpress.com/2024/01/hny24-2024-01-12T212810.901.jpg", "publishedAt": "2024-01-12T16:02:32Z", "content": "Karnataka Chief Minister Siddaramaiah, who has welcomed the Congress party’s decision to stay away from the consecration of the Ram Mandir in Ayodhya on January 22, said on Friday that he would visit… [+2455 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After Congress no to temple invite, Uddhav Sena reiterates plan: will spend Jan 22 at a Ram exile site in Nashik", "description": "Sena (UBT) chief earlier said: \"We are glad about the Ram Mandir but I have been saying it should remain a matter of faith and not take a political colour. We will go to Ayodhya whenever we wish\"", "url": "https://indianexpress.com/article/political-pulse/congress-no-to-temple-invite-uddhav-sena-jan-22-ram-exile-site-nashik-9105191/", "urlToImage": "https://images.indianexpress.com/2024/01/uddhav-1600-2.jpg", "publishedAt": "2024-01-11T10:44:00Z", "content": "A day after the Congress declined the invitationextended to its leaders Sonia Gandhi, Mallikarjun Kharge and Adhir Ranjan Chowdhury for the forthcoming Ram Temple consecration ceremony in Ayodhya, sa… [+2856 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Lights, marigolds and high security: 18 photos show Ayodhya all prepped up for Ram Mandir event tomorrow", "description": "The consecration ceremony of the idol of Ram Lalla is scheduled to take place at 12.20 pm on Monday", "url": "https://indianexpress.com/article/india/current-ayodhya-ram-mandir-images-facebook-whatsapp-status-9120722/", "urlToImage": "https://images.indianexpress.com/2024/01/ayodhya-13-1.jpg", "publishedAt": "2024-01-21T16:26:27Z", "content": "Last minute preparations and final touches continue in full swing in the temple town as the much-anticipated ‘pran pratishtha’  (consecration) ceremony of the Ayodhya Ram Mandir is just a day away. T… [+684 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Ram Mandir inauguration: Turn every area into a mini Ayodhya on Jan 22, say Punjab RSS workers", "description": "Punjab BJP President Sunil Jakhar said, “BJP workers are being told to launch swachhata abhiyan in all religious places… they should light their houses with diyas on January 22.”", "url": "https://indianexpress.com/article/cities/chandigarh/ram-mandir-inauguration-every-area-mini-ayodhya-jan-22-rss-workers-9098111/", "urlToImage": "https://images.indianexpress.com/2024/01/Ram-Janmabhoomi-1600.jpg", "publishedAt": "2024-01-06T13:35:45Z", "content": "BJP, RSS, and VHP workers in Punjab are busy these days with their door-to-door campaign ahead of the inauguration of the Ram Mandir in Ayodhya.Talking about their activities, RSS Prachar Pramukh (Lu… [+2499 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "‘Clearly an RSS-BJP event’: Congress says won’t attend Ram Mandir inauguration", "description": "\"The inauguration of the incomplete temple by the leaders of the BJP and the RSS has been obviously brought forward for electoral gain,\" read the statement.", "url": "https://indianexpress.com/article/india/congress-ram-mandir-inauguration-9103401/", "urlToImage": "https://images.indianexpress.com/2024/01/ram-mandir-2.jpg", "publishedAt": "2024-01-10T10:40:39Z", "content": "The Congress party Wednesday said it will skip the upcoming inauguration of the Ram Mandir in Ayodhya on January 22,\r\n“The inauguration of the incomplete temple by the leaders of the BJP and the RSS … [+764 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haven’t received formal invitation yet, want to visit Ram Mandir with family: Kejriwal", "description": "Says he was informed that only he will be invited because of security arrangements; will go with wife, children and parents after January 22.", "url": "https://indianexpress.com/article/cities/delhi/ayodhya-ram-mandir-inauguration-invitation-arvind-kejriwal-9113986/", "urlToImage": "https://images.indianexpress.com/2024/01/PTI01_16_2024_000319B.jpg", "publishedAt": "2024-01-17T13:16:14Z", "content": "Delhi Chief Minister Arvind Kejriwal said Wednesday that he will go to the Ram Temple in Ayodhya with his family after the consecration ceremony on January 22 and that he has not got a formal invitat… [+1848 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Upasika Singhal", "title": "As part of Ram Mandir outreach, RSS, BJP deliver packages to homes in Delhi", "description": "This is part of efforts by the RSS as well as the BJP to reach out to at least 60 crore households across India ahead of the ceremony.", "url": "https://indianexpress.com/article/cities/delhi/as-part-of-ram-mandir-outreach-rss-bjp-deliver-packages-to-homes-in-delhi-9100907/", "urlToImage": "https://images.indianexpress.com/2024/01/PACKET-NEW.jpg", "publishedAt": "2024-01-08T23:58:58Z", "content": "A picture of the Ram Mandir in Ayodhya, a pamphlet with instructions on how they can partake in the celebrations despite not being a part of the temples consecration ceremony on January 22, and a sma… [+2193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "How does Ayodhya’s Ram Mandir look from space? ISRO releases satellite image", "description": "Cartosat is a remote-sensing satellite with the capability to provide in-orbit stereo images.", "url": "https://indianexpress.com/article/india/isro-satellite-image-ayodhya-ram-mandir-inauguration-9120407/", "urlToImage": "https://images.indianexpress.com/2024/01/ISRO-releases-satellite-image-of-Ram-Mandir.png", "publishedAt": "2024-01-21T11:27:55Z", "content": "The Hyderabad-based National Remote Sensing Centre of ISRO on Sunday released satellite imagery of the newly-constructed Ram Temple in Ayodhya.Taken from the Indian Remote Sensing Satellite, this ima… [+1260 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saman Husain", "title": "Hotels to markets: NDMC area in Delhi gears up with pujas, bhandaras for Ram Mandir ceremony", "description": "The NDMC’s Horticulture Department will display floral boards at prominent locations, facades will be illuminated with LED lights, and live telecasts will be broadcasted on LED screens across the NDMC area.", "url": "https://indianexpress.com/article/cities/delhi/hotels-to-markets-ndmc-area-in-delhi-gears-up-with-pujas-bhandaras-for-ram-mandir-ceremony-9118205/", "urlToImage": "https://images.indianexpress.com/2024/01/ran-mandir-delhi.jpeg", "publishedAt": "2024-01-19T23:10:18Z", "content": "With two days to go for the Ram Mandir consecration ceremony, extensive preparations are underway at hotels and markets under the New Delhi Municipal Councils jurisdiction.According to NDMC vice-chai… [+2566 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lalmani Verma", "title": "Credit for Ram Mandir not one person’s. It goes to swayamsevaks … L K Advani had a huge role: Vinay Katiyar", "description": "Former MP and Bajrang Dal founder says the temple will have no effect in polls: \"It is not political\"; adds, \"The issues of Mathura and Kashi will be considered after that, but won't leave them”", "url": "https://indianexpress.com/article/political-pulse/ram-mandir-lk-advani-vinay-katiyar-9095293/", "urlToImage": "https://images.indianexpress.com/2024/01/Vinay-Katiyar-1.jpg", "publishedAt": "2024-01-04T12:50:44Z", "content": "Firebrand BJP leader and Bajrang Dal founder Vinay Katiyar, 69, was a part of the Ram Mandir movement. Katiyar spoke to The Indian Express at his home in Lucknow, looking back at the movement, the co… [+5406 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Amitabh Bachchan-Abhishek Bachchan, Vicky Kaushal-Katrina Kaif leave for Ayodhya to attend Ram Mandir Pran Pratishtha ceremony", "description": "In the early hours of January 22, Amitabh Bachchan, Abhishek Bachchan, Vicky Kaushal, Katrina Kaif, Madhuri Dixit, Shriram Madhav Nene, Jackie Shroff, and Ayushmann Khurrana were seen leaving for Ayodhya to be a part of the Pran Pratishtha ceremony.", "url": "https://indianexpress.com/article/entertainment/bollywood/amitabh-bachchan-abhishek-bachchan-vicky-kaushal-katrina-kaif-leave-for-ayodhya-to-attend-ram-mandir-pran-pratishtha-ceremony-9121117/", "urlToImage": "https://images.indianexpress.com/2024/01/Amitabh-Bachchan-Abhishek-Bachchan-Vicky-Kaushal-Katrina-Kaif-leave-for-Ayodhya-1600.jpg", "publishedAt": "2024-01-22T03:26:15Z", "content": "The auspicious day of the Ram Mandir Pran Pratishtha ceremony to be held in Ayodhya is finally here. While many celebrities already arrived in Ayodhya on Sunday, Monday morning too saw a set of celeb… [+1436 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "HanuMan box office collection day 3: Teja Sajja film emerges as first hit of 2024, posts a Rs 40.15 cr first weekend collection", "description": "HanuMan box office collection day 3: Teja Sajja’s film capitalised on its first weekend and Pongal holiday and has posted a Rs 40.15 crore earning on the first weekend.", "url": "https://indianexpress.com/article/entertainment/bollywood/hanuman-box-office-collection-day-3-teja-sajja-film-emerges-as-first-hit-of-2024-posts-a-rs-40-15-cr-first-weekend-collection-9109805/", "urlToImage": "https://images.indianexpress.com/2024/01/hanuman-1.jpg", "publishedAt": "2024-01-15T07:07:12Z", "content": "The mythological superhero film HanuMan, starring Teja Sajja in the lead role, has been experiencing a consistent surge in its box office collections since its release on Friday. The film capitalised… [+2534 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "HanuMan distributor announces donation of over Rs 2.6 crore to Ram temple", "description": "One of the distributors of the Teja Sajja-starrer HanuMan have pledged to donate over Rs 2.6 crore to the Ram temple, a day before the consecration ceremony in Uttar Pradesh's Ayodhya.", "url": "https://indianexpress.com/article/entertainment/telugu/hanuman-distributor-announces-donation-of-over-rs-2-6-crore-to-ram-temple-9120301/", "urlToImage": "https://images.indianexpress.com/2024/01/teja.jpg", "publishedAt": "2024-01-21T10:11:46Z", "content": "Mythri Movie Makers, one of the distributors of the Teja Sajja-starrer HanuMan, on Sunday said it would donate over Rs 2.6 crore to the Ram temple, a day before the consecration ceremony in Uttar Pra… [+2142 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "‘Lord Ram will curse BJP for this treatment,’ says Sanjay Raut after Uddhav receives invite via speed post", "description": "After not having received the invite earlier, the Sena had announced that Thackeray would be performing a Maha Aarti in Nashik's Godavari river bank on January 22 followed by a darshan of Kalaram Mandir of Panchavati in Nashik where Lord Ram was said to have …", "url": "https://indianexpress.com/article/cities/mumbai/shiv-sena-gets-ram-mandir-invitation-via-speed-post-uddhav-thackeray-sanjay-raut-9119521/", "urlToImage": "https://images.indianexpress.com/2024/01/raut_de65dd.jpg", "publishedAt": "2024-01-20T18:08:37Z", "content": "Just two days ahead of the consecration of Ram Temple in Ayodhya, Shiv Sena UBT chief Uddhav Thackeray received an invite to attend the consecration ceremony via speed post on Saturday.The move has f… [+1847 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vikas Pathak", "title": "The Congress role in Ram Mandir movement: 1949 to 1980s, how the party failed to speak in one voice", "description": "After the dispute arose in 1949-’50, there was a push from within Congress to maintain the status quo and decades later party leader leader Dau Dayal Khanna took the initiative that led to the revival of the Ram Janmabhoomi movement.", "url": "https://indianexpress.com/article/political-pulse/congress-role-ram-mandir-ayodhya-movement-1949-1980-9110122/", "urlToImage": "https://images.indianexpress.com/2024/01/The-Congress-role-in-Ram-Mandir-movement-1949-to-1980s-how-the-party-failed-to-speak-in-one-voice.png", "publishedAt": "2024-01-15T09:33:14Z", "content": "A couple of months before the Congress officially refused to attend the consecration ceremony of the Ram Temple in Ayodhya on January 22, the partys Madhya Pradesh chief ministerial candidate Kamal N… [+7057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Neha Banka", "title": "For Hindus in Mauritius, Ram temple connects them to their identity", "description": "One and a half years later, the Indian diaspora will be commemorating the consecration of the Ram temple on January 22. But perhaps non-resident Indians in a few countries will be celebrating the grand event in a form similar to that being witnessed in Maurit…", "url": "https://indianexpress.com/article/india/for-hindus-in-mauritius-ram-temple-connects-them-to-their-identity-9119882/", "urlToImage": "https://images.indianexpress.com/2024/01/cover_37c4d0.jpg", "publishedAt": "2024-01-21T05:07:18Z", "content": "In August 2020, when Prime Minister Narendra Modi laid the foundation stone of the Ram Temple in Ayodhya, approximately 6,000 km away in the island nation of Mauritius, an 89-year-old man sat on his … [+11969 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SC Bar Association writes to CJI requesting ‘no adverse order be passed’ today", "description": "The celebrations will commence early in the morning and continue until late evening”.", "url": "https://indianexpress.com/article/india/sc-bar-association-writes-to-cji-requesting-no-adverse-order-be-passed-today-9120855/", "urlToImage": "https://images.indianexpress.com/2024/01/supreme-court-12.jpg", "publishedAt": "2024-01-21T18:12:38Z", "content": "Supreme Court Bar Association (SCBA) President Adish C. Aggarwala on Sunday wrote to Chief Justice of India D Y Chandrachud requesting that no adverse order be passed on Monday, when the Ram Mandir a… [+1624 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Ram Temple Pran Pratishtha: Operation clean Ayodhya on", "description": "With additional 1,500 safai mitras brought in, the administration is covering drains, setting up 1,000 permanent toilets, 500 temporary toilets, 30 mobile toilets, 22 water kiosks among a host of things at the temple town", "url": "https://indianexpress.com/article/cities/lucknow/ram-temple-event-operation-clean-ayodhya-on-9104247/", "urlToImage": "https://images.indianexpress.com/2024/01/AyodhyagraffitiPTI-4COL.jpg", "publishedAt": "2024-01-10T23:10:10Z", "content": "AYODHYA IS witnessing massive deployment of human resources amid preparations for the consecration ceremony of the Ram Templeon January 22 and the expected influx of visitors in the following month.O… [+6375 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mahender Singh Manral", "title": "Ahead of Ram Temple consecration, Centre blocks 100 social media accounts, asks police to increase presence in sensitive areas", "description": "The MHA has said recent activities show global jihadi groups and Pakistan-based outfits are planning to carry out attacks in India.", "url": "https://indianexpress.com/article/india/ahead-of-ram-temple-consecration-centre-blocks-100-9120133/", "urlToImage": "https://images.indianexpress.com/2024/01/cover_510f9b.jpg", "publishedAt": "2024-01-21T07:37:49Z", "content": "The Centre has blocked around 100 social media accounts days after it asked police chiefs of all states and Union Territories to monitor suspicious activities or attempts being made to disturb the co… [+1966 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PM indulging in gimmick show: CM Mamata on Ram temple inauguration", "description": "Slams Centre over raids by CBI and ED, says BJP running an agency govt", "url": "https://indianexpress.com/article/cities/kolkata/pm-indulging-in-gimmick-show-cm-mamata-on-ram-temple-inauguration-9102565/", "urlToImage": "https://images.indianexpress.com/2024/01/Mamata-4coleee.jpg", "publishedAt": "2024-01-09T22:51:41Z", "content": "Accusing Prime Minister Narendra Modi of indulging in a “gimmick show” with the inauguration of Ram temple in Ayodhya ahead of Lok Sabha elections, West Bengal Chief Minister Mamata Banerjee on Tuesd… [+2696 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "With direct flight, Kolkata residents fullfill long-standing dream to visit Ayodhya", "description": "Though the ‘pran pratishtha’ (consecration) of the Ram Temple is slated for January 22, Kolkata residents are planning trips ahead to get a look at how the temple town is preparing for the inauguration.", "url": "https://indianexpress.com/article/cities/kolkata/with-direct-flight-kolkata-residents-fullfill-long-standing-dream-to-visit-ayodhya-9116448/", "urlToImage": "https://images.indianexpress.com/2024/01/AyodhyaInternationalAirportPTI-4COL.jpg", "publishedAt": "2024-01-18T22:34:55Z", "content": "The newly launched direct flight between Kolkata and Ayodhya in Uttar Pradesh has fulfilled a long-standing dream of many residents in the city who have grown up hearing about the Ram temple. Launche… [+3282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Religious leaders praise PM for special ritual ahead of ceremony", "description": "", "url": "https://indianexpress.com/article/india/religious-leaders-praise-pm-for-special-ritual-ahead-of-ceremony-9107497/", "urlToImage": "https://images.indianexpress.com/2024/01/modi-new.jpg", "publishedAt": "2024-01-13T01:06:39Z", "content": "The heads of various religious organisations and spiritual figures lauded Prime Minister Narendra Modi on Friday for his decision to begin a special 11-day religious exercise preceding the consecrati… [+2149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bharat Jodo Nyay Yatra Live Updates, Day 6: Rahul Gandhi to address supporters at Assam’s Gogamukh today", "description": "Rahul Gandhi's Bharat Jodo Nyay Yatra Live Updates: The yatra is in Assam for eight days.", "url": "https://indianexpress.com/article/india/bharat-jodo-nyay-yatra-launch-live-updates-rahul-gandhi-congress-9116600/", "urlToImage": "https://images.indianexpress.com/2024/01/rahulgandhi.jpg", "publishedAt": "2024-01-19T03:43:30Z", "content": "Rahul Gandhis Bharat Jodo Nyay Yatra begins: In mandir season, Congress says BJP using Ram for votes\r\nHoping to generate much-needed political momentum to take on the BJP in the Lok Sabha elections b… [+1098 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat confidential: Close To Reality", "description": "Feeling excited about the invitation and his participation in the event, Sarawagi said, “I got an invitation from RSS (leader) Nandkishore Sharma to attend the event.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-confidential-close-to-reality-9092619/", "urlToImage": "https://images.indianexpress.com/2024/01/gujarat-confidential-1.jpg", "publishedAt": "2024-01-02T23:49:27Z", "content": "12th Fail, the Vikrant Massey-starrer that was released on Disney Hotstar last week after the big screen acclaim, seems to have sparked interest among police officials in the state. The movie based o… [+1640 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Security beefed up in Kolkata as city gears up for shobha yatras, Mamata’s all-faith rally", "description": "Kolkata Police has deployed 3,500 police personnel, including Assistant Commissioner-ranked officers, in the city with additional forces being put on standby in each division under its jurisdiction, sources said.", "url": "https://indianexpress.com/article/cities/kolkata/security-beefed-up-in-kolkata-as-city-gears-up-for-shobha-yatras-mamatas-all-faith-rally-9121021/", "urlToImage": "https://images.indianexpress.com/2024/01/mamata_4a71e8.jpg", "publishedAt": "2024-01-22T00:51:57Z", "content": "West Bengal chief minister Mamata Banerjee (Express File Photo)Elaborate security arrangements have been made in Kolkata ahead of the Ram Temple consecration ceremony in Ayodhya on Monday with the ci… [+4906 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "FIR against Karnataka BJP MP Anantkumar Hegde over mosque demolition remarks", "description": "In his speech, the Uttara Kannada MP called for the demolition of several mosques in Karnataka, along the lines of the Babri Masjid. The BJP had distanced itself from Anantkumar Hegde’s remarks.", "url": "https://indianexpress.com/article/cities/bangalore/fir-against-karnataka-bjp-mp-anantkumar-hegde-over-mosque-demolition-remarks-9109990/", "urlToImage": "https://images.indianexpress.com/2020/02/Anantkumar-Hegde.jpg", "publishedAt": "2024-01-15T07:48:30Z", "content": "The police in Karnatakas Uttar Kannada district have filed a case against BJP MP Anantkumar Hegde, pertaining to promoting enmity between different religious groups, over his controversial remarks in… [+1799 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shahid Pervez", "title": "From the Urdu Press: ‘BJP has taken over Ayodhya event… Oppn needs to find a counter-narrative’, ‘Rahul Yatra test will be ally attendance’", "description": "“The Shankaracharyas are not against the Temple but against its politicisation. This is also the Opposition parties’ position. However, the BJP cannot call the Shankaracharyas ‘anti-Hindus’,” writes Siasat", "url": "https://indianexpress.com/article/political-pulse/urdu-press-bjp-ayodhya-oppn-rahul-yatra-attendance-9111542/", "urlToImage": "https://images.indianexpress.com/2024/01/From-the-Urdu-Press-‘BJP-has-taken-over-Ayodhya-event.-Oppn-needs-to-find-a-counter-narrative-‘Rahul-Yatra-test-will-be-ally-attendance.jpg", "publishedAt": "2024-01-16T10:11:05Z", "content": "As the politics over the January 22 Ram Temple inauguration builds up in the run-up to the Lok Sabha polls, the Urdu Press has turned its gaze on some key questions about the idea of India, expressin… [+5692 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "Will urge US Ambassador to open consulate in Bangalore soon: EAM S Jaishankar", "description": "During PM Modi’s visit to the US in June 2023, it was announced that the US would open two new consulates in Bengaluru and Ahmedabad, while India would establish a mission in Seattle.", "url": "https://indianexpress.com/article/cities/bangalore/jaishankar-us-ambassador-bangalore-consulate-9097162/", "urlToImage": "https://images.indianexpress.com/2024/01/jaishankar-1.jpg", "publishedAt": "2024-01-05T17:17:28Z", "content": "External Affairs Minister S Jaishankar on Friday said he will urge the US Ambassador to India to set up a consulate in Bengaluru soon. Jaishankar made the remark while speaking at the launch event of… [+2837 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "Bilkis Bano case: Convicts not at home in Dahod villages, families tight-lipped", "description": "Bilkis and her family had left their house in Randhikpur on February 28, 2002, soon after the train-burning incident in Godhra the previous day. On March 3, 2002, she was gangraped and 14 members of the family, including her three-year-old daughter, were kill…", "url": "https://indianexpress.com/article/cities/ahmedabad/bilkis-bano-case-convicts-not-at-home-in-dahod-villages-families-tight-lipped-9100866/", "urlToImage": "https://images.indianexpress.com/2024/01/From-left-Residences-of-Govind-Nai-and-Radheshyam-Shah-convicts-in-the-case-at-Singvad-in-Dahod-on-Monday.-Nirmal-Harindran.jpg", "publishedAt": "2024-01-08T22:40:36Z", "content": "Locked doors and a policeman on guard is the sight that greets one at the twin villages of Randhikpur and Singvad, where at least nine of the 11 convicts in the Bilkis Bano gangrape case lived, and a… [+4804 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "As BJP seeks K’taka governor’s intervention, Siddaramaiah says national party shouldn’t defend ‘criminal suspect’", "description": "Citing the Lokayukta arrest of BS Yediyurappa during BJP rule, the chief minister asks if Srikanth Poojari is ‘any greater Hindu or devotee of Rama than Yediyurappa’.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bjp-governor-intervention-siddaramaiah-9093859/", "urlToImage": "https://images.indianexpress.com/2024/01/siddaramaiah.jpg", "publishedAt": "2024-01-03T13:18:00Z", "content": "Karnatakas Opposition BJP has taken the issue of the recent arrest of a kar sevak in a 31-year-old rioting case to the governor and protested in different parts of the state even as the Congress gove… [+5580 chars]"}, {"source": {"id": null, "name": "Project Syndicate"}, "author": "Shashi Tharoor", "title": "India’s Hindu “Emperor” Wants a Third Term", "description": "Indian Prime Minister Narendra Modi was portrayed as an avatar of economic development in the 2014 election campaign, and a national-security warrior in 2019. But both of those narratives have collapsed, so the ruling Bharatiya Janata Party has returned to ba…", "url": "https://www.project-syndicate.org/commentary/india-2024-election-bjp-focus-on-modi-hindu-nationalist-credentials-by-shashi-tharoor-2024-01", "urlToImage": "https://webapi.project-syndicate.org/library/b33c46ced2a68b68437e9d8c77a88022.2-1-super.1.jpg", "publishedAt": "2024-01-05T09:55:31Z", "content": "Indian Prime Minister Narendra Modi was portrayed as an avatar of economic development in the 2014 election campaign, and a national-security warrior in 2019. But both of those narratives have collap… [+6381 chars]"}, {"source": {"id": null, "name": "ComingSoon.net"}, "author": "Rohan Verma", "title": "Nayanthara’s Annapoorani Removed From Netflix", "description": "Nayanthara‘s Annapoorani has been facing backlash since its release. Netizens criticized the movie by claiming that the movie promoted the concept of ‘Love Jihad’ and hurt the religious sentiments of the Hindu community. In the film, there is a detailed scene…", "url": "https://www.comingsoon.net/indian/news/1481425-nayanthara-annapoorani-removed-from-netflix", "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/01/anan.jpg?resize=1200,630", "publishedAt": "2024-01-11T11:06:37Z", "content": "Nayantharas Annapoorani has been facing backlash since its release. Netizens criticized the movie by claiming that the movie promoted the concept of Love Jihad and hurt the religious sentiments of th… [+2359 chars]"}, {"source": {"id": null, "name": "Skift"}, "author": "Skift", "title": "Oyo to Add 400 New Properties to Push Religious Tourism: India Report", "description": "Religious tourism has been experiencing a resurgence in India, and Oyo recognizes the importance of securing the first-mover advantage in this growing trend. -Peden Doma Bhutia", "url": "https://skift.com/2024/01/16/oyo-to-add-400-new-properties-to-push-religious-tourism-india-report/", "urlToImage": "https://skift.com/wp-content/uploads/2023/05/OYO-Townhouse-1.jpg", "publishedAt": "2024-01-17T04:00:00Z", "content": "IPO-bound hospitality and travel technology company Oyo has announced that it would open around 400 properties in popular spiritual destinations by year end.\r\nThe expansion will focus on destinations… [+5022 chars]"}, {"source": {"id": null, "name": "Daily Beast"}, "author": "Kaisar Andrabi, Bhat Burhan", "title": "Humiliating Shock for Narendra Modi’s Mega-Hyped Vanity Project", "description": "Deepak Gupta/Hindustan Times via Getty Images\r\nAYODHYA, India—It was supposed to be an iconic moment to cement Prime Minister Narendra Modi’s place as one of the greatest Hindu nationalists in Indian history, but despite all the fanfare and celebrations he ha…", "url": "https://www.thedailybeast.com/ram-mandir-humiliating-shock-for-narendra-modis-mega-hyped-vanity-project", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2214,w_3936,x_0,y_234/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1705690582/24019-buhran-shcok-modi-vanity-hero_d2g7ch", "publishedAt": "2024-01-20T04:17:21Z", "content": "AYODHYA, IndiaIt was supposed to be an iconic moment to cement Prime Minister Narendra Modis place as one of the greatest Hindu nationalists in Indian history, but despite all the fanfare and celebra… [+12805 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sol Amaya", "title": "Un sueño nacionalista hindú desde hace décadas está a punto de hacerse realidad. ¿Qué quiere decir esto?", "description": "Aunque aún no está completo, el extenso Ram Janmabhoomi Mandir cumple una vieja promesa de Modi de construir un templo hindú en el sitio de una mezquita del siglo XVI que fue destruida por turbas hindúes hace más de 30 años.", "url": "https://cnnespanol.cnn.com/2024/01/20/sueno-nacionalista-hindu-trax/", "urlToImage": "https://cnnespanol.cnn.com/wp-content/uploads/2024/01/hindu22.jpg?quality=100&strip=info", "publishedAt": "2024-01-20T18:39:44Z", "content": "(CNN) -- Han comenzado a llegar obsequios ornamentados a la ciudad india de Ayodhya mientras el primer ministro del país, Narendra Modi, se prepara para inaugurar un gran templo hindú que espera refu… [+8934 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Sophie Landrin", "title": "En Inde, Modi lance sa campagne en instrumentalisant l’hindouisme", "description": "Le premier ministre nationaliste a fait du temple de Ram, bâti à l’endroit où des hindouistes avaient illégalement détruit une ancienne mosquée, son tremplin pour obtenir un troisième mandat à l’issue des élections générales, prévues au printemps.", "url": "https://www.lemonde.fr/international/article/2024/01/21/en-inde-modi-lance-sa-campagne-en-instrumentalisant-l-hindouisme_6212077_3210.html", "urlToImage": "https://img.lemde.fr/2024/01/20/0/307/4621/3081/1440/960/60/0/11e5552_1705736114632-044219.jpg", "publishedAt": "2024-01-21T05:00:20Z", "content": "Le premier ministre indien, Narendra Modi, le 30 décembre 2023, lors de linauguration de la gare et de laéroport dAyodhya (Uttar Pradesh). RAJESH KUMAR SINGH / AP\r\nLe trajet en avion, lun des premier… [+2921 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shehzad Poonawalla", "title": "I say this as a Bharatiya Muslim: Congress rejection of Ram Mandir invite is hypocritical", "description": "Ram sabke hai. He belongs to all of humanity. For the Congress to boycott this epochal moment only flags how low the party is willing to go for vote-bank politics and obstructionism", "url": "https://indianexpress.com/article/opinion/columns/bharatiya-muslim-congress-rejection-ram-temple-invite-hypocritical-9106633/", "urlToImage": "https://images.indianexpress.com/2024/01/vnn-1.png", "publishedAt": "2024-01-12T09:31:11Z", "content": "I write this not as a spokesperson of any party, but as a proud Bharatiya Muslim.January 22, 2024, will not just see the pran prathistha and the installation of the idol of Ram at the Ram Mandir in A… [+7393 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Coomi Kapoor", "title": "Inside Track by Coomi Kapoor: Keep them guessing", "description": "Some Modi followers feel their presence might divert attention from the PM. In fact, temple trust general secretary Champat Rai initially even suggested that there was no point issuing invitations to the two nonagenarians out of consideration for their age.", "url": "https://indianexpress.com/article/opinion/columns/ram-mandir-consecration-ceremony-l-k-advani-murli-manohar-joshi-ram-mandir-movement-9108321/", "urlToImage": "https://images.indianexpress.com/2024/01/advani-joshi.jpg", "publishedAt": "2024-01-14T02:25:03Z", "content": "The two BJP elder statesmen, L K Advani and Murli Manohar Joshi, have kept both the VHP and BJP guessing as to whether they will attend the Ram mandir consecration ceremony in Ayodhya or not.Some Mod… [+4358 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Neeta Lal", "title": "Canâ\u0080\u0099t attend Ayodhya Ram Mandir inauguration? Head to Kurukshetra instead", "description": "Visit Kurukshetra in Haryana, where the historic battle of Mahabharata between the Pandavas and Kauravas was fought, where Hindu god Krishna sermonised the sacred Bhagavad Gita to Arjun, and where a new Krishna Museum has come up.", "url": "https://www.moneycontrol.com/news/trends/travel/cant-attend-ayodhya-ram-mandir-inauguration-head-to-kurukshetra-instead-12071161.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/01/IMG_8989-770x433.jpg", "publishedAt": "2024-01-17T16:21:03Z", "content": "Even as hordes are hotfooting to Ayodhya for the consecration of the Ram temple on January 22, we took a detour to explore Kurukshetra in Haryana. Barely a two-and-a-half hour ride from Delhi-NCR, th… [+5591 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "25 crore people lifted out of poverty by Modi govt: Sarbananda Sonowal", "description": "Speaking at a public gathering in Kendrapara district on Friday, the Union Minister of Ports, Shipping and Waterways and Ayush said Modi#39;s dynamic and inspiring leadership has ensured that the fruits of governance reach everyone in the society.", "url": "https://www.moneycontrol.com/news/india/25-crore-people-lifted-out-of-poverty-by-modi-govt-sarbananda-sonowal-12090461.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Sarbananda-Sonowal-770x433.jpg", "publishedAt": "2024-01-20T04:23:09Z", "content": "More than 25 crore Indians have been pulled out from poverty during the nine and half years of the BJP-led NDA government under the leadership of Prime Minister Narendra Modi, said Union Minister Sar… [+1760 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Zoya Springwala", "title": "Ayodhya magic lifts this small-cap stock 70% in a month; Vibrant Gujarat, Lakshadweep campaign help", "description": "Owing to limited capex, its luxury tents/cottages can break even in the first year itself, said Nuvama.", "url": "https://www.moneycontrol.com/news/business/markets/ayodhya-magic-lifts-this-small-cap-stock-70-in-a-month-vibrant-gujarat-lakshadweep-campaign-help-12033151.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/01/Sensex_market_Nifty-770x433.jpg", "publishedAt": "2024-01-11T05:50:19Z", "content": "With the upcoming inauguration of the Ram Mandir in Ayodhya, tourism firm Praveg is anticipating significant benefits from the increased number of devotees visiting the religious site. Praveg, which … [+3209 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Maryam Farooqui", "title": "Temple towns emerge as travel hotspots, Ayodhya to further boost spiritual tourism", "description": "While the entire India tourism market is estimated to record a a compound annual growth rate (CAGR) of 7-8 percent, spiritual tourism will grow 9-10 percent for next 5-7 years. Spiritual tourism which played a major role in the recovery of tourism in India in…", "url": "https://www.moneycontrol.com/news/technology/temple-towns-emerge-as-travel-hotspots-ayodhya-to-further-boost-spiritual-tourism-12013271.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/12/Tirupati-770x433.jpg", "publishedAt": "2024-01-08T07:32:42Z", "content": "Ayodhya has joined the list of growing temple towns of India that are recording a boom in tourism in the post-Covid phase driven by infrastructure development in these tourist spots.\r\nData indicates … [+7563 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Anita Rao Kashi", "title": "Beyond Ayodhya Ram Mandir, 7 most spectacular Ram temples in India", "description": "As the entire countryâ\u0080\u0099s focus shifts to Ayodhya and the inauguration of the Ram Mandir, it is apt to cast a look at some of the other iconic Ram temples in the country.", "url": "https://www.moneycontrol.com/news/trends/travel/beyond-ayodhya-ram-mandir-7-most-spectacular-ram-temples-in-india-12070821.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/01/Kodandarama-Temple-Hiremagalur-Karnataka-2-770x433.jpg", "publishedAt": "2024-01-17T13:51:34Z", "content": "All eyes are turned towards Ayodhya in Uttar Pradesh as the curtains are ready to go up on an iconic temple that is rooted in the Indian psyche and various kinds of celebrations are expected to conti… [+5332 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Ram Mandir holiday defers Nova Agritech, Epack Durable IPOs, Medi Assist, Maxposure listings", "description": "The Rs 640-crore Epack Durable IPO will now close on January 24 instead of earlier closing date of January 23, while the listing of its shares will be on January 30 against January 29 earlier.", "url": "https://www.moneycontrol.com/news/business/ipo/ram-mandir-holiday-defers-nova-agritech-epack-durable-ipos-medi-assist-maxposure-listings-12099311.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/Morning-Scan-7-770x433.jpg", "publishedAt": "2024-01-22T01:38:03Z", "content": "After the announcement of January 22 as a holiday, all public issues lined up to open or close that day, or scheduled to be listed on the day or later in the truncated week, have been deferred by a d… [+2365 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Clash between 2 groups near Mumbai during car and motorbike rally; 6 detained", "description": "While chanting slogans, some of the persons allegedly burst firecrackers, following which a group of locals came out with wooden sticks. They had an argument with the participants and attacked their vehicles, an official said.", "url": "https://www.moneycontrol.com/news/india/clash-between-2-groups-near-mumbai-during-car-and-motorbike-rally-6-detained-12100421.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/08/Collage-Maker-22-Aug-2023-09-18-AM-3580-770x433.jpg", "publishedAt": "2024-01-22T04:38:55Z", "content": "A clash broke out between members of two communities during a vehicle rally on the outskirts of Mumbai following which six persons were detained, police said on Monday.\r\nTension gripped the area at a… [+1281 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Chhattisgarh govt declares January 22 as #39;dry day#39; to mark Ram temple consecration in Ayodhya", "description": "&quot;As you all know that from December 25 till January 2, we have been observing 'good governance' day. Ram Raj has been the model of our good governance,&quot; Sai told reporters on Tuesday evening.", "url": "https://www.moneycontrol.com/news/india/chhattisgarh-govt-declares-january-22-as-dry-day-to-mark-ram-temple-consecration-in-ayodhya-11991061.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/07/Ram-Mandir-770x433.png", "publishedAt": "2024-01-03T03:31:50Z", "content": "Chhattisgarh Chief Minister Vishnu Deo Sai has said his government has decided to declare January 22 as a \"dry day\" as the consecration of Ram temple will take place in Ayodhya on that day.\r\n\"As you … [+1331 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Ayodhya 2.0: Transformed holy town turns a page with temple pivot", "description": "It was the 2019 Supreme Court verdict on the fractious Ramjanmabhoomi-Babri Masjid issue that paved the way for the progress of this pilgrim city which till a few years ago was a sleepy town in Uttar Pradesh.", "url": "https://www.moneycontrol.com/news/india/ayodhya-2-0-transformed-holy-town-turns-a-page-with-temple-pivot-12100331.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/01/MixCollage-22-Jan-2024-09-17-AM-8055-770x433.jpg", "publishedAt": "2024-01-22T04:32:55Z", "content": "Security barricades, barbed wires and frequent frisking by police personnel have been a common sight in Ayodhya. But the holy city has now undergone a paradigm shift fuelled by massive infrastructure… [+3881 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Aparna Iyer", "title": "Moneycontrol Pro Panorama | Budgeting for healthy banksÂ", "description": "In this edition of Moneycontrol Pro Panorama: Investors await Q3 earnings, time for a second green revolution, donâ\u0080\u0099t buy the multi-asset funds story blindly, Ram Mandirand the electoral gain for BJP and more", "url": "https://www.moneycontrol.com/news/opinion/moneycontrol-pro-panorama-budgeting-for-healthy-banks-12038981.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/10/Asian-central-banks-770x433.jpg", "publishedAt": "2024-01-12T08:47:20Z", "content": "Dear Reader, \r\nThe compulsions on every Union Budget are many, even if it is an interim one this time. The finance minister has to balance the desire to be populist ahead of national elections and th… [+4335 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Maryam Farooqui", "title": "Travel demand, hotel bookings surge in Ayodhya ahead of Ram temple inauguration", "description": "Along with Varanasi, Ayodhya is seeing an increase of close to 5x more searches for check-in on January 20, 21, and 22, 2024 as compared to the year before, according to data by Agoda", "url": "https://www.moneycontrol.com/news/trends/travel/travel-demand-hotel-bookings-surge-in-ayodhya-ahead-of-ram-temple-inauguration-12003961.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/12/Ram-Mandir-Ayodhya-770x433.jpg", "publishedAt": "2024-01-05T10:34:13Z", "content": "Ayodhya has recorded a 3x surge in searches on the travel platform Agoda ahead of the Ram temple inauguration.\r\nAlong with Varanasi, Ayodhya is seeing an increase of close to 5x more searches for che… [+5650 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "PVR-Inox up 3% on heavy volumes, gets #39;buy#39; upgrade on healthy outlook", "description": "Elara Securities has upgraded rating the PVR-Inox to &quot;buy&quot;, with a target price of Rs 1,900", "url": "https://www.moneycontrol.com/news/business/markets/pvr-inox-up-3-on-heavy-volumes-gets-buy-upgrade-on-healthy-outlook-12092381.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/08/PVR-Inox-770x433.jpg", "publishedAt": "2024-01-20T08:35:21Z", "content": "PVR-Inox shares gained 3.6 percent on January afternoon 20 on heavy volumes. The stock of the multiplex chain also got a buy upgrade and a higher target price from Elara Securities.\r\nAround 67.98 lak… [+2003 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Vatsala Kamat", "title": "Moneycontrol Pro Panorama | Did markets react too soon to rate cut possibilities?", "description": "In today#39;s edition of Moneycontrol Pro Panorama: India#39;s Teesta failure allows China to swoop in, growing solar energy capacity brings challenges, steel industry faces a new risk, stick to your investment strategy amid market bubble, and more", "url": "https://www.moneycontrol.com/news/opinion/moneycontrol-pro-panorama-did-markets-react-too-soon-to-rate-cut-possibilities-11996801.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/12/stocks_sensex_nifty_stockmarket3-1-770x433.jpg", "publishedAt": "2024-01-04T08:37:24Z", "content": "Dear Reader,\r\nThe uncertain tone in the minutes of the US Federal Open Market Committees December meeting has poured cold water on investor euphoria of rate cuts. Indeed, the markets overreacted to t… [+3795 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "Sébastian SEIBT", "title": "En Inde, le temple hindou qui sert les intérêts politiques de Narendra Modi", "description": "L’inauguration, lundi, du nouveau temple Ram Mandir au nord de l’Inde représente une étape importante pour la campagne de réélection du Premier ministre Narendra Modi. C’est aussi le dernier chapitre d’un conflit religieux entre musulmans et hindous vieux de …", "url": "https://www.france24.com/fr/asie-pacifique/20240121-inde-narendra-modi-au-nom-d-un-nouveau-temple-hindou-elections", "urlToImage": "https://s.france24.com/media/display/2c2d1d70-b6e5-11ee-b780-005056bf30b7/w:1280/p:16x9/190124-ram-mandir-m.jpg", "publishedAt": "2024-01-21T14:45:50Z", "content": "Linauguration, lundi, du nouveau temple Ram Mandir au nord de lInde représente une étape importante pour la campagne de réélection du Premier ministre Narendra Modi. Cest aussi le dernier chapitre du… [+8153 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Prayer and politics: New temple brings Modi praise, but critics see it as election gambit", "description": "The unfinished Hindu temple — set to be India's largest — opens Monday on the controversial site where a 16th-century mosque once stood, delivering on a decades-old Hindu nationalist promise.", "url": "https://www.cbc.ca/news/world/india-hindu-temple-modi-1.7090144", "urlToImage": "https://i.cbc.ca/1.7090220.1705845802!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/india-religion-temple-ayodhya.JPG", "publishedAt": "2024-01-21T15:01:47Z", "content": "The religious chants echoed through loudspeakers, and some of the thousands of devotees who have descended on the holy city of Ayodhya chimed in, even as the frenzy of construction around India's lar… [+6094 chars]"}, {"source": {"id": null, "name": "International Business Times"}, "author": "Bhuvan BAGGA", "title": "Modi To Open Flashpoint Temple Symbolising His Changing India", "description": "India's Prime Minister Narendra Modi will on Monday inaugurate a temple that embodies the triumph of his muscular Hindu nationalist politics, in an unofficial start to his re-election campaign this year.", "url": "https://www.ibtimes.com/modi-open-flashpoint-temple-symbolising-his-changing-india-3722473", "urlToImage": "https://d.ibtimes.com/en/full/4507077/workers-construction-site-temple-hindu-deity-ram-ayodhya-december-29.jpg", "publishedAt": "2024-01-19T05:12:22Z", "content": "India's Prime Minister Narendra Modi will on Monday inaugurate a temple that embodies the triumph of his muscular Hindu nationalist politics, in an unofficial start to his re-election campaign this y… [+4494 chars]"}, {"source": {"id": null, "name": "Odditycentral.com"}, "author": "Spooky", "title": "Indian Woman Has Been Speaking Only an Hour a Day for the Last 32 Years", "description": "An 85-year-old woman is set to end a self-imposed 30-year vow of silence that only allowed her to speak for an hour a day. Saraswati Devi, fondly known as ‘Mauni Mata’, began her ‘maun vrat’ (vow of silence) in 1992. She devoted her life to Lord Ram after the…", "url": "https://www.odditycentral.com/news/indian-woman-has-been-speaking-only-an-hour-a-day-for-the-last-32-years.html", "urlToImage": "https://www.odditycentral.com/wp-content/uploads/2024/01/Mouni-Mata.webp", "publishedAt": "2024-01-12T07:57:38Z", "content": "An 85-year-old woman is set to end a self-imposed 30-year vow of silence that only allowed her to speak for an hour a day.\r\nSaraswati Devi, fondly known as ‘Mauni Mata’, began her ‘maun vrat’ (vow of… [+1764 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Mithil Aggarwal and Jennifer Jett", "title": "Modi to open grand Hindu temple with eye on India’s upcoming elections", "description": "India is set to come to a halt Monday as Prime Minister Narendra Modi presides over the opening of a grand Hindu temple on a contested holy site.", "url": "https://www.nbcnews.com/news/world/india-lord-ram-temple-ayodhya-narendra-modi-rcna134654", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240119-Ayodhya-hindu-temple-mb-0925-d71e3b.jpg", "publishedAt": "2024-01-21T19:00:00Z", "content": "India is set to come to a halt Monday as Prime Minister Narendra Modi presides over the opening of a grand Hindu temple on a contested holy site that has become a symbol of religious tensions in the … [+2665 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/rhea-mogul\">Rhea Mogul</a>, <a href=\"/profiles/vedika-sud\">Vedika Sud</a>, Sania Farooqui, Aishwarya S Iyer and Jerome Taylor, CNN", "title": "India's Ayodhya Ram Mandir temple to be inaugurated by Modi", "description": "India's Prime Minister Narendra Modi is presiding over the inauguration of a lavish Hindu temple on the site of a destroyed centuries-old mosque. Follow here for live news updates.", "url": "https://www.cnn.com/asia/live-news/india-ram-mandir-ayodhya-inauguration-24-01-22-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/240120184108-01-ayodhya-muslims-ram-temple-super-tease.jpg", "publishedAt": "2024-01-22T04:27:28Z", "content": "Tens of thousands of pious Hindus are thronging the small town of Ayodhya in a bid to catch a glimpse of the much-anticipated Ram idol in the new temple. \r\nThe temple doesn't open to the public until… [+1301 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "webdesk@voanews.com (Shaikh Azizur Rahman)", "title": "India Prepares to Inaugurate Ram Temple on Site of Demolished Mosque", "description": "A north Indian town is preparing for a mega event next week, as Prime Minister Narendra Modi will inaugurate a grand Hindu temple that symbolizes the country’s surging Hindu cultural nationalism, a movement also known as Hindutva.\r\n The inauguration of the gr…", "url": "https://www.voanews.com/a/india-prepares-to-inaugurate-ram-temple-on-site-of-demolished-mosque/7448780.html", "urlToImage": "https://gdb.voanews.com/ED2609E0-8CA1-49C8-946C-808763B7772E.jpg", "publishedAt": "2024-01-21T03:26:36Z", "content": "A north Indian town is preparing for a mega event next week, as Prime Minister Narendra Modi will inaugurate a grand Hindu temple that symbolizes the countrys surging Hindu cultural nationalism, a mo… [+6273 chars]"}, {"source": {"id": null, "name": "Foreign Policy"}, "author": "Michael Kugelman", "title": "The Ram Mandir Temple Is Part of Modi’s Playbook", "description": "The Indian leader fulfills a signature promise with his consecration of the controversial landmark—just as elections approach.", "url": "https://foreignpolicy.com/2024/01/17/ram-mandir-temple-inauguration-modi-india-elections/", "urlToImage": "https://foreignpolicy.com/wp-content/uploads/2024/01/ram-mandir-temple-ayodhya-GettyImages-1885670012.jpg?w=1000", "publishedAt": "2024-01-18T01:00:12Z", "content": "Welcome to Foreign Policys South Asia Brief.Welcome to Foreign Policys South Asia Brief.\r\nThe highlights this week: Indian Prime Minister Narendra Modi aims to rally his base with a controversial tem… [+9043 chars]"}, {"source": {"id": null, "name": "Foreign Policy"}, "author": "Michael Kugelman", "title": "Bangladesh’s All-but-Certain Election", "description": "Prime Minister Sheikh Hasina and her party are nearly guaranteed to win on Sunday. The rest of the region may welcome the result.", "url": "https://foreignpolicy.com/2024/01/03/bangladesh-election-opposition-boycott-awami-league-sheikh-hasina/", "urlToImage": "https://foreignpolicy.com/wp-content/uploads/2024/01/bangladesh-election-market-GettyImages-1889141150.jpg?w=1000", "publishedAt": "2024-01-03T22:15:52Z", "content": "Welcome to Foreign Policys South Asia Brief.Welcome to Foreign Policys South Asia Brief.\r\nThe highlights this week: Bangladesh prepares for elections on Sunday with a nearly certain outcome, Pakistan… [+10817 chars]"}, {"source": {"id": null, "name": "Bangkok Post"}, "author": "Reuters", "title": "Wealthy Indians splurge ahead of temple opening", "description": "AYODHYA, India - The private jet parking lots at airports near Ayodhya are full and the shops have run out of gold-plated idols, as wealthy devotees prepare for the invitation-only opening ceremony of one of Hinduism’s holiest temples.", "url": "https://www.bangkokpost.com/world/2727095/wealthy-indians-splurge-ahead-of-temple-opening", "urlToImage": "https://static.bangkokpost.com/media/content/20240119/c1_2727095_240119170748_700.jpeg", "publishedAt": "2024-01-19T10:06:00Z", "content": "AYODHYA, India - The private jet parking lots at airports near Ayodhya are full and the shops have run out of gold-plated idols, as wealthy devotees prepare for the invitation-only opening ceremony o… [+3073 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Audrey Truschke", "title": "India’s Ayodhya Temple Is a Huge Monument to Hindu Supremacy", "description": "The temple's consecration on Jan. 22 by Prime Minister Narendra Modi is the BJP's latest bid to show India is for Hindus, and Hindus alone.", "url": "https://time.com/6564148/ayodhya-ram-temple-modi-india/", "urlToImage": "https://api.time.com/wp-content/uploads/2024/01/ayodya-temple-hindu-supremacy-1.jpg?quality=85", "publishedAt": "2024-01-19T11:00:15Z", "content": "On Jan. 22, Indian Prime Minister Narendra Modi will inaugurate a three-story monument made of marble, sandstone, and teak that features 44 gates and 392 intricately-carved pillars. But the structure… [+5380 chars]"}, {"source": {"id": null, "name": "Globalsecurity.org"}, "author": "John Pike", "title": "India Prepares to Inaugurate Ram Temple on Site of Demolished Mosque", "description": "A north Indian town is preparing for a mega event next week, as Prime Minister Narendra Modi will inaugurate a grand Hindu temple that symbolizes the country's surging Hindu cultural nationalism, a movement also known as Hindutva.", "url": "https://www.globalsecurity.org/wmd/library/news/india/2024/india-240120-voa01.htm", "urlToImage": null, "publishedAt": "2024-01-21T07:59:01Z", "content": "By Shaikh Azizur Rahman January 20, 2024\r\nA north Indian town is preparing for a mega event next week, as Prime Minister Narendra Modi will inaugurate a grand Hindu temple that symbolizes the country… [+6560 chars]"}, {"source": {"id": null, "name": "Globalsecurity.org"}, "author": "John Pike", "title": "Transcript of Weekly Media Briefing by the Official Spokesperson (January 04, 2024)", "description": "No description", "url": "https://www.globalsecurity.org/wmd/library/news/india/2024/india-240104-india-meab01.htm", "urlToImage": null, "publishedAt": "2024-01-05T07:28:47Z", "content": "India - Ministry of External Affairs\r\nJanuary 04, 2024\r\nShri Randhir Jaiswal, Official Spokesperson: Good afternoon friends. A very warm welcome to this first press engagement with all of you, and Ha… [+28835 chars]"}, {"source": {"id": null, "name": "MediaNama.com"}, "author": "Sarasvati NT", "title": "Netflix Takes Down CBFC-Approved Film ‘Annapoorani’ Strengthening Concerns of Rising OTT Censorship in India", "description": "Nayanthara-starrer Annapoorani, which essentially tells the story of a female chef, was approved by the Central Board of Film Certification (CBFC), before its theatrical release in Tamil Nadu last December.\nThe post Netflix Takes Down CBFC-Approved Film ‘Anna…", "url": "https://www.medianama.com/2024/01/223-netflix-pulls-film-annapoorani-raises-censorship-concerns/", "urlToImage": "https://www.medianama.com/wp-content/uploads/2020/09/censorship-4266441_1920.jpg.jpg", "publishedAt": "2024-01-12T10:18:05Z", "content": "On January 10, Netflix took down a Tamil film Annapoorani: The Goddess of Food from the platform after an FIR was filed by one Ramesh Solanki, Hindu IT Cell member, who claimed that some scenes in th… [+4448 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Ram Mandir: Numbers Unveiled", "description": "India News: Delve into the significant numbers that define the Ram Mandir, from its architectural intricacies to the devotion it symbolizes. Explore the historical and cultural significance of this monumental structure.", "url": "https://timesofindia.indiatimes.com/india/ram-mandir-exploring-the-significance-of-the-monumental-structure/articleshow/106954326.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106954275,width-1070,height-580,imgsize-1071443,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-18T09:08:30Z", "content": "10 vegetarian foods that can easily replace meat"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI News Desk", "title": "Nagara-style architecture, 5 pavilions, 161-feet tall: 20 must-know points about newly-built Ram Temple in Ayodhya", "description": "India News: NEW DELHI: With anticipation for the sacred consecration ceremony of the Ram Mandir reaching a feverish pitch, the Shri Ram Janmabhoomi Teerth Kshetra.", "url": "https://timesofindia.indiatimes.com/india/nagara-style-architecture-5-pavilions-161-feet-tall-20-points-about-newly-built-ram-temple-in-ayodhya/articleshow/106736990.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106737097,width-1070,height-580,imgsize-110010,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-11T15:30:07Z", "content": "12 benefits of eating Gawar Phalli"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "'BJP doesn't have lease of Ram Mandir, it belongs to entire nation,' says former Madhya Pradesh CM Kamal Nath", "description": "Former Madhya Pradesh Chief Minister Kamal Nath takes a potshot at Bhartiya Janata Party, saying Ram Mandir belongs to the entire nation. Nath states that everyone has their right to the Ram Mandir and there is no question of taking credit for it. Meanwhile, …", "url": "https://timesofindia.indiatimes.com/india/bjp-doesnt-have-lease-of-ram-mandir-it-belongs-to-entire-nation-says-former-madhya-pradesh-cm-kamal-nath/articleshow/106665638.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106665776,width-1070,height-580,imgsize-872677,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-09T09:54:26Z", "content": "Indias famous national parks as imagined by AI"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "BJP plans nationwide live telecast of Shri Ram Mandir consecration", "description": "The Bharatiya Janata Party (BJP) plans to telecast the grand consecration ceremony of Shri Ram Mandir in Ayodhya live on the booth level across the country. Prime Minister Narendra Modi is expected to attend the ceremony on January 22, 2024. BJP workers will …", "url": "https://timesofindia.indiatimes.com/india/bjp-plans-nationwide-live-telecast-of-shri-ram-mandir-consecration/articleshow/106589887.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106589918,width-1070,height-580,imgsize-67030,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-06T05:05:26Z", "content": "Superfood Moringa Soup which can fix a number of deficiencies"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Temples across US gears up for Ram Mandir festivities", "description": "Indian Americans join temple celebrations across the US to commemorate the consecration ceremony of Lord Ram's temple in Ayodhya. The construction after 500 years marks an important day of faith and celebration for Hindus worldwide. Festivities include cultur…", "url": "https://timesofindia.indiatimes.com/world/us/temples-across-us-gears-up-for-ram-mandir-festivities/articleshow/107001914.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-107001937,width-1070,height-580,imgsize-1006755,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-20T02:28:21Z", "content": "Trendy sari blouse designs with a modern edge"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Deepthi Sanjiv", "title": "Ram Mandir inauguration: Security beefed up in DK, Udupi", "description": "India News: MANGALURU: Mangaluru City police have made elaborate security arrangements in the wake of the inauguration of Ram Mandir in Ayodhya on Monday.", "url": "https://timesofindia.indiatimes.com/india/ram-mandir-inauguration-security-beefed-up-in-dk-udupi/articleshow/107034566.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-21T17:54:02Z", "content": "10 aesthetic paintings to enhance the vibe of your living room"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "56 bhog prasad reaches Ayodhya, to be offered to Ram Lalla 'first' after Pran Pratishtha", "description": "A devotee from Lucknow has brought '56 bhog prasad' to be offered to Ram Lalla 'first' after the Pran Pratishtha ceremony in Ayodhya. The Prasad will be distributed among the devotees after the ceremony. The idol of Lord Ram was placed inside the sanctum sanc…", "url": "https://timesofindia.indiatimes.com/india/56-bhog-prasad-reaches-ayodhya-to-be-offered-to-ram-lalla-first-after-pran-pratishtha/articleshow/106995857.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106996089,width-1070,height-580,imgsize-40778,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-19T16:08:28Z", "content": "AI imagines world leaders attending the Pran Pratishtha ceremony in Ram Mandir, Ayodhya"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI News Desk", "title": "Congress will not attend Ram Mandir inauguration, calls it 'BJP-RSS event'", "description": "India News: NEW DELHI: The Congress on Wednesday announced that it will not attend the Ram Mandir inauguration in Ayodhya on January 22.", "url": "https://timesofindia.indiatimes.com/india/congress-will-not-attend-ram-mandir-inauguration-calls-it-bjp-rss-event/articleshow/106698316.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106698277,width-1070,height-580,imgsize-355416,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-10T10:44:18Z", "content": "Baby names inspired by the holy rivers of India"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI News Desk", "title": "Ram temple Pran Pratishtha: What opposition leaders will be doing on January 22", "description": "NEW DELHI: While Prime Minister Narendra Modi will be presiding over the Ram Mandir consecration ceremony in Ayodhya on January 22, several opposition.", "url": "https://timesofindia.indiatimes.com/india/ram-temple-pran-pratishtha-what-opposition-leaders-will-be-doing-on-january-22/articleshow/107009984.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-107010442,width-1070,height-580,imgsize-1939110,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-20T09:38:01Z", "content": "Breathtaking ethnic looks of Shoaib Maliks third wife Sana Javed"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI News Desk", "title": "Ahead of Pran Pratishta ceremony Champat Rai takes stock of preparations at Karsevakpuram in Ayodhya", "description": "Shri Ram Janmabhoomi Teerth Kshetra General Secretary Champat Rai visited Karsevakpuram in Ayodhya on Wednesday to assess the progress of work ahead of the Pran Pratishta ceremony at the temple on January 22. Karsevakpuram, located around two kilometres from …", "url": "https://timesofindia.indiatimes.com/india/ahead-of-pran-pratishta-ceremony-champat-rai-takes-stock-of-preparations-at-karsevakpuram-in-ayodhya/articleshow/106926432.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106927439,width-1070,height-580,imgsize-1350295,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-17T10:01:00Z", "content": "Tips to reconnect with your teenager in their difficult times"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI News Desk", "title": "Ram Mandir: PM Modi releases audio message ahead of consecration ceremony on Jan 22", "description": "India News: NEW DELHI: Prime Minister Narendra Modi on Friday released an audio message ahead of the Ram temple consecration ceremony in Ayodhya on January 22.", "url": "https://timesofindia.indiatimes.com/india/ram-mandir-pm-modi-releases-audio-message-ahead-of-consecration-ceremony-on-jan-22/articleshow/106747352.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106747344,width-1070,height-580,imgsize-72824,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-12T03:51:19Z", "content": "12 benefits of eating Gawar Phalli"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI News Desk", "title": "Ram Mandir inauguration: Fortunate to have been invited for pran pratishtha ceremony, PM Modi says", "description": "NEW DELHI: Prime Minister Narendra Modi on Monday said that he is fortunate to have been invited for the consecration ceremony of Ram temple in Ayodhy.", "url": "https://timesofindia.indiatimes.com/india/ram-mandir-inauguration-fortunate-to-have-been-invited-for-pran-pratishtha-ceremony-pm-modi-says/articleshow/106861190.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106861439,width-1070,height-580,imgsize-36020,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-15T09:08:14Z", "content": "How to make fermented rice Korean skin essence at home"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bhavika Jain", "title": "As Ayodhya shines again, property prices are on fire", "description": "The upcoming 'pran pratishtha' ceremony of the Ram temple has triggered a real estate boom in Ayodhya. Property prices have surged by 25-30% since the 2019 Supreme Court verdict. Land rates have dramatically risen, reaching as high as Rs 6,000-Rs 7,000 per sq…", "url": "https://timesofindia.indiatimes.com/india/as-ayodhya-shines-again-property-prices-are-on-fire/articleshow/107001931.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-107001947,width-1070,height-580,imgsize-778735,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-20T02:34:33Z", "content": "AI imagines world leaders attending the Pran Pratishtha ceremony in Ram Mandir, Ayodhya"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Biswendu Bhattacharjee", "title": "Tripura chief minister Manik Saha raises six demands in NEC plenary meeting", "description": "Read about Tripura Chief Minister Manik Saha's six demands in the NEC plenary meeting. Find out the key drivers for the holistic development of Tripura and the state's commitment to advancing its socio-economic landscape.", "url": "https://timesofindia.indiatimes.com/india/tripura-chief-minister-manik-saha-raises-six-demands-in-nec-plenary-meeting/articleshow/106993993.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106994006,width-1070,height-580,imgsize-79046,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-19T14:05:21Z", "content": "AI imagines world leaders attending the Pran Pratishtha ceremony in Ram Mandir, Ayodhya"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI News Desk", "title": "Pradhan Mantri Rashtriya Bal Puraskar to be conferred on 19 children on January 22", "description": "Pradhan Mantri Rashtriya Bal Puraskar to be conferred on 19 exceptional children on January 22. Prime Minister Narendra Modi will interact with the awardees on January 23. The awards are conferred upon children in the age group 5 – 18 years, for their excelle…", "url": "https://timesofindia.indiatimes.com/india/pradhan-mantri-rashtriya-bal-puraskar-to-be-conferred-on-19-children-on-january-22/articleshow/106996276.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106996276,width-1070,height-580,imgsize-19402,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-19T16:43:32Z", "content": "AI imagines world leaders attending the Pran Pratishtha ceremony in Ram Mandir, Ayodhya"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pradeep Thakur", "title": "ED sends extradition request to UAE for Mahadev app accused", "description": "Enforcement Directorate has sent an extradition request to the UAE seeking repatriation of Mahadev Online Book betting syndicate masterminds Sourabh Chandrakar and Ravi Uppal while simultaneously working diplomatic channels to get them deported, which is a le…", "url": "https://timesofindia.indiatimes.com/india/ed-sends-extradition-request-to-uae-for-mahadev-app-accused/articleshow/106998598.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106999293,width-1070,height-580,imgsize-21634,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-19T22:23:15Z", "content": "AI imagines world leaders attending the Pran Pratishtha ceremony in Ram Mandir, Ayodhya"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Road restrictions announced for Kalaghoda festival by the Mumbai Traffic Police", "description": "Find out the road restrictions announced by the Mumbai Traffic Police for the upcoming Kalaghoda festival. Plan your travel accordingly to avoid any inconvenience.", "url": "https://timesofindia.indiatimes.com/india/road-restrictions-for-kalaghoda-festival-mumbai-traffic-police-announcement/articleshow/106995384.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106995396,width-1070,height-580,imgsize-41542,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-19T15:36:11Z", "content": "AI imagines world leaders attending the Pran Pratishtha ceremony in Ram Mandir, Ayodhya"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IANS", "title": "Ram Mandir Pran Pratishtha ceremony: 35 chartered planes bringing VIPs to be parked in Lucknow, Kanpur", "description": "India News: Nearly 35 chartered planes, including those flying Amitabh Bachchan and filmstar Pawan Kalyan, will be parked at the Chakeri airport in Kanpur and Amausi airport in Lucknow. The aircraft will be used to transport VIPs to Ayodhya for the Pran Prati…", "url": "https://timesofindia.indiatimes.com/india/35-chartered-planes-bringing-vips-to-be-parked-in-lucknow-kanpur/articleshow/107023754.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-21T04:27:16Z", "content": "Sana Javed and ex-husband Umair Jaswal's stylish old photos resurface"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rajeev Dikshit", "title": "‘Nothing wrong in consecrating idol before shikhar construction’", "description": "Amidst questions being raised over proposed consecration of Ram Lalla’s idol on January 22 inside an incomplete temple building at Ayodhya, Kashi’s astrology scholar Pt Ganeshwar Shastri Dravid, who had decided muhurt for the foundation laying of Ram Mandir a…", "url": "https://timesofindia.indiatimes.com/india/nothing-wrong-in-consecrating-idol-before-shikhar-construction/articleshow/106844418.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106844429,width-1070,height-580,imgsize-1073240,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-14T21:38:55Z", "content": "7 Indian foods declared 'best in the world'"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Neha Lalchandani", "title": "Hoteliers betting big on Ayodhya", "description": "With the opening of Ram Mandir, Ayodhya expects a surge in tourism. The first week could see 3-7 lakh visitors daily, stabilizing at over 1 lakh in the coming months. The hospitality industry is capitalizing on this opportunity with 125 hotel projects in the …", "url": "https://timesofindia.indiatimes.com/india/hoteliers-betting-big-on-ayodhya/articleshow/107032307.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-107032308,width-1070,height-580,imgsize-1125042,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-21T13:40:00Z", "content": "Sana Javed and ex-husband Umair Jaswal's stylish old photos resurface"}]